In [1]:
import pandas as pd
import numpy as np

In [3]:
df=pd.DataFrame({"key1":list("aabbab"),"key2":["one","two","three"]*2,"data1":np.random.randn(6),"data2":np.random.randn(6)})
df

  key1   key2     data1     data2
0    a    one  0.642666 -0.593823
1    a    two  0.292234 -0.625425
2    b  three  1.095194 -1.023936
3    b    one -0.184374 -0.455525
4    a    two  1.714744 -0.715309
5    b  three -1.188025 -0.018430

In [6]:
group=df["data1"].groupby(df["key1"])

In [7]:
group

In [8]:
group.mean()

key1
a    0.883215
b   -0.092402
Name: data1, dtype: float64

In [9]:
ave=df["data1"].groupby([df["key1"],df["key2"]]).mean()
ave

key1  key2
a     one      0.642666
      two      1.003489
b     one     -0.184374
      three   -0.046415
Name: data1, dtype: float64

In [10]:
ave.unstack()

key2       one     three       two
key1
a     0.642666       NaN  1.003489
b    -0.184374 -0.046415       NaN

In [15]:
df.groupby("key1").mean(numeric_only=True)

         data1     data2
key1
a     0.883215 -0.644852
b    -0.092402 -0.499297

In [16]:
df.groupby(["key1","key2"]).mean()

               data1     data2
key1 key2
a    one    0.642666 -0.593823
     two    1.003489 -0.670367
b    one   -0.184374 -0.455525
     three -0.046415 -0.521183

In [ ]:
for name,group in df.groupby